Tutorials/compressible/obliqueShock/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          75;
        startFace       16762;
    }
    outlet
    {
        type            patch;
        nFaces          75;
        startFace       16837;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          38;
        startFace       16912;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          113;
        startFace       16950;
    }
    obstacle
    {
        type            patch;
        nFaces          75;
        startFace       17063;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          16950;
        startFace       17138;
    }
)

// ************************************************************************* //
